# 2) კომენტარებით ახსენით ფუნქციები


print("hello".upper())     


print("HELLO".lower())     


print("python".capitalize())   


print("hello".find("e"))   # 1


# 3) მომხმარებელს შემოატანინეთ წინადადება და დაბეჭდეთ პატარა ასოებით

sentence = input("შეიყვანე წინადადება: ")
print(sentence.lower())


# 4) მომხმარებელს შემოატანინეთ ელფოსტის მისამართი და შეამოწმეთ შეიცავს თუ არა '@'

email = input("შეიყვანე ელფოსტა: ")
result = "@" in email
print(str(result).upper())


# 5) მომხმარებელს შემოატანინეთ წიგნის დასახელება და დაბეჭდეთ სათაურის სტილში

book = input("შეიყვანე წიგნის დასახელება: ")
print(book.title())


# 6) მომხმარებელს შემოატანინეთ წინადადება და სიმბოლო. დაითვალეთ რამდენჯერ გვხვდება

text = input("შეიყვანე წინადადება: ")
symbol = input("შეიყვანე სიმბოლო: ")
print(text.count(symbol))


# 7) მომხმარებელს შემოატანინეთ სიტყვა და შეამოწმეთ არის თუ არა დიდი ასოებით

word = input("შეიყვანე სიტყვა: ")

if word.isupper():
    print("სიტყვა უკვე დიდია!")
else:
    print(word.upper())