# ფუნქცია არის კოდი რომელიც ასრულებს კონკრეტულ დავალებას.
# ფუნქცია გამოიყენება იმისთვის რომ ერთი და იგივე კოდი ბევრჯერ არ დავწეროთ.

# print() არის  ფუნქცია Python-ში რომელიც იტანს ტერმინალში.


# არგუმენტები არის მნიშვნელობები რომლებიც ფუნქციას გადაეცემა ფრჩხილებში.


name = "ნიკა"
age = 13
profession = "Web Developer"
skill = "HTML , CSS , phyton"
dream = "მქონდეს ბევრი money"

print(f"გამარჯობა, ჩემი სახელია {name}, ვარ {age} წლის. ჩემი პროფესიაა {profession}. ვიცი და ვსწავლობ {skill}-ს და ჩემი მთავარი მიზანია {dream}. მზად ვარ განვითარებისთვის და ახალი გამოცდილების მისაღებად.")